Функция Get(Знач Адрес) Экспорт
    
    СтруктураURL = РазбитьURL(Адрес);
    Сервер       = СтруктураURL["Сервер"];
    Адрес        = СтруктураURL["Адрес"];
    
    Запрос     = СоздатьЗапрос(Адрес);
    Соединение = СоздатьСоединение(Сервер);   
    Ответ      = Соединение.ВызватьHTTPМетод("GET", Запрос);
    
    Если Ответ.КодСостояния = 302 Или Ответ.КодСостояния = 301 Тогда
        Возврат Get(Ответ.Заголовки["Location"]);
    КонецЕсли;
    
    Ответ = Ответ.ПолучитьТелоКакДвоичныеДанные();
    
    Возврат Ответ;
    
КонецФункции

Функция GetJSON(Знач Адрес) Экспорт 
    
    Ответ = Get(Адрес);
    Ответ = JsonВСтруктуру(Ответ);
      
    Возврат Ответ;

КонецФункции

Функция РазбитьURL(Знач URL)

    URL = СтрЗаменить(URL, "https://", "");
    URL = СтрЗаменить(URL, "http://", "");
    URL = СтрЗаменить(URL, ":443", "");

    Адрес  = Прав(URL, СтрДлина(URL) - СтрНайти(URL, "/", НаправлениеПоиска.СНачала) + 1);
    Сервер = Лев(URL, СтрНайти(URL, "/", НаправлениеПоиска.СНачала) - 1);
    
    Попытка        
        SSL = Новый ЗащищенноеСоединениеOpenSSL;   
    Исключение
        Сервер = "https://" + Сервер;
    КонецПопытки;
      
    СтруктураВозврата = Новый Структура;
    СтруктураВозврата.Вставить("Сервер", Сервер);
    СтруктураВозврата.Вставить("Адрес" , Адрес);

    Возврат СтруктураВозврата;

КонецФункции

Функция СоздатьЗапрос(Знач Адрес)
      
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Accept-Encoding", "gzip");
    Заголовки.Вставить("Accept"         , "*/*");
    Заголовки.Вставить("Connection"     , "keep-alive");
    Заголовки.Вставить("Accept-Charset" , "utf-8");
         
    НовыйЗапрос = Новый HTTPЗапрос(Адрес);
    
    Возврат НовыйЗапрос;
    
КонецФункции

Функция СоздатьСоединение(Знач Сервер)
    
    Попытка 
        SSL = Новый ЗащищенноеСоединениеOpenSSL;
        Возврат Новый HTTPСоединение(Сервер, 443, , , , 3000, SSL);
    Исключение
        Возврат Новый HTTPСоединение(Сервер, 443, , , , 3000);
    КонецПопытки;
    
КонецФункции

Функция JsonВСтруктуру(Знач Текст)

    Если Не ЗначениеЗаполнено(Текст) Тогда
        Возврат "";
    КонецЕсли;
    
    Текст = ?(ТипЗнч(Текст) = Тип("ДвоичныеДанные"), ПолучитьСтрокуИзДвоичныхДанных(Текст), Текст);

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Текст);

    Данные = ПрочитатьJSON(ЧтениеJSON, Истина, Неопределено, ФорматДатыJSON.ISO);
    ЧтениеJSON.Закрыть();

    Возврат Данные;

КонецФункции
