#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьИндекс(Знач АдресаИндекса, Знач КлючХранилища) Экспорт
    
    ТекущаяВерсия   = ПолучитьВерсию();
    ЛогОбновления   = "";
    СтруктураВерсии = Новый Структура("Обновление, ТекущаяВерсия", Ложь, ТекущаяВерсия);
    
    ДобавитьСтрокуЛога("Начало обновления индекса...", ЛогОбновления);
       
    Для Каждого АдресИндекса Из АдресаИндекса Цикл
        
        ДобавитьСтрокуЛога("Получение индекса из " + АдресИндекса, ЛогОбновления);
        
        Попытка
            
            СтруктураИндекса = YPM_ИнструментыКлиентСервер.GetJSON(АдресИндекса);
            МассивИндекса    = СтруктураИндекса["chunks"];
            ВерсияИндекса    = СокрЛП(СтруктураИндекса["ypmVersion"]);
            
            Если ВерсияИндекса <> ТекущаяВерсия Тогда
                
                СтруктураВерсии.Вставить("Обновление", Истина);
                СтруктураВерсии.Вставить("НоваяВерсия", ВерсияИндекса);
                СтруктураВерсии.Вставить("Описание"   , СтруктураИндекса["updateDescription"]);
                СтруктураВерсии.Вставить("URLФайла"   , СтруктураИндекса["fileUrl"]);
                
            КонецЕсли;
            
             
            ДобавитьСтрокуЛога("Индекс получен! Число элементов: " + Строка(МассивИндекса.Количество()), ЛогОбновления);
            ДобавитьСтрокуЛога("Дата актуализации: " + Строка(СтруктураИндекса["updatedAt"]), ЛогОбновления);
            
        Исключение
            ДобавитьСтрокуЛога(ОписаниеОшибки(), ЛогОбновления);
            Возврат;
        КонецПопытки;
        
        Для Каждого Блок Из МассивИндекса Цикл
            
            Попытка
                ДобавитьСтрокуЛога("Получение данных из блока " + Блок, ЛогОбновления);
                ДанныеБлока = YPM_ИнструментыКлиентСервер.GetJSON(Блок);
                ЗаписатьДанныеБлока(ДанныеБлока);
            Исключение
                ДобавитьСтрокуЛога(ОписаниеОшибки(), ЛогОбновления);
                Продолжить;
            КонецПопытки;
        КонецЦикла;
    
    КонецЦикла;
    
    ДобавитьСтрокуЛога("Загрузка завершена!", ЛогОбновления);
    
    СтруктураВерсии.Вставить("Лог", ЛогОбновления);
    
    ПоместитьВоВременноеХранилище(СтруктураВерсии, КлючХранилища);
    
КонецПроцедуры

Функция ПоставитьУстановитьЗвезду(Знач ПолноеИмя, Знач Токен) Экспорт
    
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Authorization", "Bearer " + Токен);
    
    Ответ  = YPM_ИнструментыКлиентСервер.GetJSON("https://api.github.com/user/starred/" + ПолноеИмя, Заголовки);
    Статус = Ответ["status"];
    
    Если Статус = "204" Тогда
        Ответ = YPM_ИнструментыКлиентСервер.Delete("https://api.github.com/user/starred/" + ПолноеИмя, ,Заголовки);
        Возврат "Добавлено в избранное!";
    ИначеЕсли Статус = "404" Тогда
        Ответ = YPM_ИнструментыКлиентСервер.Put("https://api.github.com/user/starred/" + ПолноеИмя, ,Заголовки);
        Возврат "Удалено из избранного!";
        
    Иначе
        
        Возврат "Ошибка: " + YPM_ИнструментыКлиентСервер.JSONСтрокой(Ответ);
        
    КонецЕсли;
    
КонецФункции

Функция ПолучитьВерсию() Экспорт
    Возврат  РасширенияКонфигурации.Получить(Новый Структура("Имя", "YPM"))[0].Версия;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДанныеБлока(Знач ДанныеБлока) 
    
    Для Каждого Репозиторий Из ДанныеБлока Цикл
       
        Название = Репозиторий["name"];
        Автор    = Репозиторий["authorName"];
        Версии   = Репозиторий["versions"];
        
        НЗ = РегистрыСведений.YPM_ИндексПакетов.СоздатьНаборЗаписей();
        НЗ.Отбор.Репозиторий.Установить(Название);
        НЗ.Отбор.Автор.Установить(Автор);
        
        НЗ.Прочитать();
        НЗ.Очистить();
        
        СтруктураЗаписи = Новый Структура;
        СтруктураЗаписи.Вставить("Репозиторий"        , Название);
        СтруктураЗаписи.Вставить("Автор"              , Автор);
        СтруктураЗаписи.Вставить("Описание"           , Репозиторий["description"]);
        СтруктураЗаписи.Вставить("СтраницаАвтора"     , Репозиторий["authorURL"]);
        СтруктураЗаписи.Вставить("СтраницаРепозитория", Репозиторий["URL"]);
        СтруктураЗаписи.Вставить("Лицензия"           , Репозиторий["license"]);
        СтруктураЗаписи.Вставить("Звезд"              , Репозиторий["stars"]);
        
        Для Каждого Версия Из Версии Цикл
            
            Файлы = Версия["files"];
            СтруктураЗаписи.Вставить("Версия", Версия["version"]);
            
            Для Каждого Файл Из Файлы Цикл
                
                СтруктураЗаписи.Вставить("Файл"      , Файл["file"]);
                СтруктураЗаписи.Вставить("АдресФайла", Файл["fileURL"]);
                СтруктураЗаписи.Вставить("Размер"    , Файл["size"]);
                СтруктураЗаписи.Вставить("Скачиваний", Файл["downloads"]);
                СтруктураЗаписи.Вставить("Тип"       , Файл["type"]);
                
                ЗаполнитьЗначенияСвойств(НЗ.Добавить(), СтруктураЗаписи);
                         
            КонецЦикла;
            
        КонецЦикла;
        
        НЗ.Записать(Истина);
         
    КонецЦикла;
    
КонецПроцедуры

Процедура ДобавитьСтрокуЛога(Знач Текст, ЛогОбновления)
   ЛогОбновления = ЛогОбновления + Текст + Символы.ПС; 
КонецПроцедуры

#КонецОбласти